"""
aliases.py — словарь синонимов для запуска программ по голосу

🧠 Зачем нужен:
Когда пользователь говорит "открой телегу" или "запусти хром",
мы хотим найти соответствующую программу в app_index.json.

Но названия в файле индекса могут быть:
- telegram
- chrome
- vscode

А пользователь может сказать:
- "телега", "тг", "гугл", "код", и т.д.

👉 Поэтому мы создаём ALIASES — словарь синонимов.  



🔗 "telegram" — это ключ, совпадающий с ключом из app_index.json
"""

ALIASES = {
    "telegram": [
        "тг"
    ],
    "stella": [
        "stella",
        "стелла",
        "стэлла"
    ],
    "eadesktop": [
        "еа",
        "иа",
        "ea десктоп",
        "еа десктоп",
        "eadesktop",
        "иа десктоп"
    ],
    "chrome": [
        "браузер",
        "гугл браузер",
        "chrome",
        "хром",
        "гугл",
        "хромиум"
    ],
    "ninja": [
        "ниндзя",
        "нинжа",
        "ninja",
        "ниндза"
    ],
    "vcpkg": [
        "ви си пикейджи",
        "vcpkg",
        "ви си пак",
        "висипак",
        "ви си пакэдж",
        "пакетный менеджер"
    ],
    "wsl": [
        "дабл ю эс эль",
        "ви эс эль",
        "wsl",
        "даблуэсэль",
        "дабл ю",
        "всел"
    ],
    "anydesk": [
        "энидиск",
        "эни-деск",
        "any desk",
        "anydesk",
        "эни диск",
        "десктоп",
        "энидеск"
    ],
    "planetvpn": [
        "planet vpn",
        "планет vpn",
        "планетвпн",
        "планета впн",
        "планет",
        "planetvpn"
    ],
    "xray": [
        "экс-рей",
        "эксрей",
        "икс",
        "рентген",
        "икс-рей",
        "иксрей",
        "xray"
    ],
    "steam": [
        "стим",
        "паровозик",
        "паровоз",
        "стеам",
        "стимчик",
        "steam",
        "стив"
    ],
    "mount&bladeiibannerlord": [
        "блэйд",
        "моунт энд блэйд",
        "mount&bladeiibannerlord",
        "моунт баннерлорд",
        "моунт",
        "баннер лорд",
        "баннерлорд"
    ],
    "warthunder": [
        "варт",
        "вартандэр",
        "вар",
        "warthunder",
        "war thunder",
        "вар тандер",
        "вартундер",
        "вартхандер",
        "вартандер"
    ]
}
